load-tests/k6/reports/capacity-auto-20260727-232358/vus-005/20260727-232359/progress-read-stdout.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: C:\Users\omano\OneDrive - Puravankara Limited\Manoranjan\Antigravity Experiment\000 Project PM\SETU\load-tests\k6\scenarios\progress-read.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 5m30s max duration (incl. graceful stop):
              * default: 5 looping VUs for 5m0s (gracefulStop: 30s)


running (0m01.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 5 VUs  0m01.0s/5m0s

running (0m02.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 5 VUs  0m02.0s/5m0s

running (0m03.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 5 VUs  0m03.0s/5m0s

running (0m04.0s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [   1% ] 5 VUs  0m04.0s/5m0s

running (0m05.0s), 5/5 VUs, 2 complete and 0 interrupted iterations
default   [   2% ] 5 VUs  0m05.0s/5m0s

running (0m06.0s), 5/5 VUs, 4 complete and 0 interrupted iterations
default   [   2% ] 5 VUs  0m06.0s/5m0s

running (0m07.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [   2% ] 5 VUs  0m07.0s/5m0s

running (0m08.0s), 5/5 VUs, 7 complete and 0 interrupted iterations
default   [   3% ] 5 VUs  0m08.0s/5m0s

running (0m09.0s), 5/5 VUs, 7 complete and 0 interrupted iterations
default   [   3% ] 5 VUs  0m09.0s/5m0s

running (0m10.0s), 5/5 VUs, 9 complete and 0 interrupted iterations
default   [   3% ] 5 VUs  0m10.0s/5m0s

running (0m11.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [   4% ] 5 VUs  0m11.0s/5m0s

running (0m12.0s), 5/5 VUs, 12 complete and 0 interrupted iterations
default   [   4% ] 5 VUs  0m12.0s/5m0s

running (0m13.0s), 5/5 VUs, 12 complete and 0 interrupted iterations
default   [   4% ] 5 VUs  0m13.0s/5m0s

running (0m14.0s), 5/5 VUs, 13 complete and 0 interrupted iterations
default   [   5% ] 5 VUs  0m14.0s/5m0s

running (0m15.0s), 5/5 VUs, 14 complete and 0 interrupted iterations
default   [   5% ] 5 VUs  0m15.0s/5m0s

running (0m16.0s), 5/5 VUs, 16 complete and 0 interrupted iterations
default   [   5% ] 5 VUs  0m16.0s/5m0s

running (0m17.0s), 5/5 VUs, 17 complete and 0 interrupted iterations
default   [   6% ] 5 VUs  0m17.0s/5m0s

running (0m18.0s), 5/5 VUs, 17 complete and 0 interrupted iterations
default   [   6% ] 5 VUs  0m18.0s/5m0s

running (0m19.0s), 5/5 VUs, 18 complete and 0 interrupted iterations
default   [   6% ] 5 VUs  0m19.0s/5m0s

running (0m20.0s), 5/5 VUs, 18 complete and 0 interrupted iterations
default   [   7% ] 5 VUs  0m20.0s/5m0s

running (0m21.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
default   [   7% ] 5 VUs  0m21.0s/5m0s

running (0m22.0s), 5/5 VUs, 22 complete and 0 interrupted iterations
default   [   7% ] 5 VUs  0m22.0s/5m0s

running (0m23.0s), 5/5 VUs, 22 complete and 0 interrupted iterations
default   [   8% ] 5 VUs  0m23.0s/5m0s

running (0m24.0s), 5/5 VUs, 23 complete and 0 interrupted iterations
default   [   8% ] 5 VUs  0m24.0s/5m0s

running (0m25.0s), 5/5 VUs, 26 complete and 0 interrupted iterations
default   [   8% ] 5 VUs  0m25.0s/5m0s

running (0m26.0s), 5/5 VUs, 28 complete and 0 interrupted iterations
default   [   9% ] 5 VUs  0m26.0s/5m0s

running (0m27.0s), 5/5 VUs, 28 complete and 0 interrupted iterations
default   [   9% ] 5 VUs  0m27.0s/5m0s

running (0m28.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [   9% ] 5 VUs  0m28.0s/5m0s

running (0m29.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  10% ] 5 VUs  0m29.0s/5m0s

running (0m30.0s), 5/5 VUs, 33 complete and 0 interrupted iterations
default   [  10% ] 5 VUs  0m30.0s/5m0s

running (0m31.0s), 5/5 VUs, 33 complete and 0 interrupted iterations
default   [  10% ] 5 VUs  0m31.0s/5m0s

running (0m32.0s), 5/5 VUs, 33 complete and 0 interrupted iterations
default   [  11% ] 5 VUs  0m32.0s/5m0s

running (0m33.0s), 5/5 VUs, 36 complete and 0 interrupted iterations
default   [  11% ] 5 VUs  0m33.0s/5m0s

running (0m34.0s), 5/5 VUs, 36 complete and 0 interrupted iterations
default   [  11% ] 5 VUs  0m34.0s/5m0s

running (0m35.0s), 5/5 VUs, 38 complete and 0 interrupted iterations
default   [  12% ] 5 VUs  0m35.0s/5m0s

running (0m36.0s), 5/5 VUs, 39 complete and 0 interrupted iterations
default   [  12% ] 5 VUs  0m36.0s/5m0s

running (0m37.0s), 5/5 VUs, 42 complete and 0 interrupted iterations
default   [  12% ] 5 VUs  0m37.0s/5m0s

running (0m38.0s), 5/5 VUs, 43 complete and 0 interrupted iterations
default   [  13% ] 5 VUs  0m38.0s/5m0s

running (0m39.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
default   [  13% ] 5 VUs  0m39.0s/5m0s

running (0m40.0s), 5/5 VUs, 46 complete and 0 interrupted iterations
default   [  13% ] 5 VUs  0m40.0s/5m0s

running (0m41.0s), 5/5 VUs, 46 complete and 0 interrupted iterations
default   [  14% ] 5 VUs  0m41.0s/5m0s

running (0m42.0s), 5/5 VUs, 47 complete and 0 interrupted iterations
default   [  14% ] 5 VUs  0m42.0s/5m0s

running (0m43.0s), 5/5 VUs, 48 complete and 0 interrupted iterations
default   [  14% ] 5 VUs  0m43.0s/5m0s

running (0m44.0s), 5/5 VUs, 48 complete and 0 interrupted iterations
default   [  15% ] 5 VUs  0m44.0s/5m0s

running (0m45.0s), 5/5 VUs, 51 complete and 0 interrupted iterations
default   [  15% ] 5 VUs  0m45.0s/5m0s

running (0m46.0s), 5/5 VUs, 52 complete and 0 interrupted iterations
default   [  15% ] 5 VUs  0m46.0s/5m0s

running (0m47.0s), 5/5 VUs, 52 complete and 0 interrupted iterations
default   [  16% ] 5 VUs  0m47.0s/5m0s

running (0m48.0s), 5/5 VUs, 52 complete and 0 interrupted iterations
default   [  16% ] 5 VUs  0m48.0s/5m0s

running (0m49.0s), 5/5 VUs, 55 complete and 0 interrupted iterations
default   [  16% ] 5 VUs  0m49.0s/5m0s

running (0m50.0s), 5/5 VUs, 56 complete and 0 interrupted iterations
default   [  17% ] 5 VUs  0m50.0s/5m0s

running (0m51.0s), 5/5 VUs, 57 complete and 0 interrupted iterations
default   [  17% ] 5 VUs  0m51.0s/5m0s

running (0m52.0s), 5/5 VUs, 58 complete and 0 interrupted iterations
default   [  17% ] 5 VUs  0m52.0s/5m0s

running (0m53.0s), 5/5 VUs, 58 complete and 0 interrupted iterations
default   [  18% ] 5 VUs  0m53.0s/5m0s

running (0m54.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
default   [  18% ] 5 VUs  0m54.0s/5m0s

running (0m55.0s), 5/5 VUs, 61 complete and 0 interrupted iterations
default   [  18% ] 5 VUs  0m55.0s/5m0s

running (0m56.0s), 5/5 VUs, 63 complete and 0 interrupted iterations
default   [  19% ] 5 VUs  0m56.0s/5m0s

running (0m57.0s), 5/5 VUs, 64 complete and 0 interrupted iterations
default   [  19% ] 5 VUs  0m57.0s/5m0s

running (0m58.0s), 5/5 VUs, 64 complete and 0 interrupted iterations
default   [  19% ] 5 VUs  0m58.0s/5m0s

running (0m59.0s), 5/5 VUs, 67 complete and 0 interrupted iterations
default   [  20% ] 5 VUs  0m59.0s/5m0s

running (1m00.0s), 5/5 VUs, 68 complete and 0 interrupted iterations
default   [  20% ] 5 VUs  1m00.0s/5m0s

running (1m01.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
default   [  20% ] 5 VUs  1m01.0s/5m0s

running (1m02.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
default   [  21% ] 5 VUs  1m02.0s/5m0s

running (1m03.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
default   [  21% ] 5 VUs  1m03.0s/5m0s

running (1m04.0s), 5/5 VUs, 73 complete and 0 interrupted iterations
default   [  21% ] 5 VUs  1m04.0s/5m0s

running (1m05.0s), 5/5 VUs, 74 complete and 0 interrupted iterations
default   [  22% ] 5 VUs  1m05.0s/5m0s

running (1m06.0s), 5/5 VUs, 74 complete and 0 interrupted iterations
default   [  22% ] 5 VUs  1m06.0s/5m0s

running (1m07.0s), 5/5 VUs, 75 complete and 0 interrupted iterations
default   [  22% ] 5 VUs  1m07.0s/5m0s

running (1m08.0s), 5/5 VUs, 76 complete and 0 interrupted iterations
default   [  23% ] 5 VUs  1m08.0s/5m0s

running (1m09.0s), 5/5 VUs, 79 complete and 0 interrupted iterations
default   [  23% ] 5 VUs  1m09.0s/5m0s

running (1m10.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
default   [  23% ] 5 VUs  1m10.0s/5m0s

running (1m11.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
default   [  24% ] 5 VUs  1m11.0s/5m0s

running (1m12.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
default   [  24% ] 5 VUs  1m12.0s/5m0s

running (1m13.0s), 5/5 VUs, 81 complete and 0 interrupted iterations
default   [  24% ] 5 VUs  1m13.0s/5m0s

running (1m14.0s), 5/5 VUs, 83 complete and 0 interrupted iterations
default   [  25% ] 5 VUs  1m14.0s/5m0s

running (1m15.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
default   [  25% ] 5 VUs  1m15.0s/5m0s

running (1m16.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
default   [  25% ] 5 VUs  1m16.0s/5m0s

running (1m17.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
default   [  26% ] 5 VUs  1m17.0s/5m0s

running (1m18.0s), 5/5 VUs, 88 complete and 0 interrupted iterations
default   [  26% ] 5 VUs  1m18.0s/5m0s

running (1m19.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
default   [  26% ] 5 VUs  1m19.0s/5m0s

running (1m20.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
default   [  27% ] 5 VUs  1m20.0s/5m0s

running (1m21.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
default   [  27% ] 5 VUs  1m21.0s/5m0s

running (1m22.0s), 5/5 VUs, 91 complete and 0 interrupted iterations
default   [  27% ] 5 VUs  1m22.0s/5m0s

running (1m23.0s), 5/5 VUs, 93 complete and 0 interrupted iterations
default   [  28% ] 5 VUs  1m23.0s/5m0s

running (1m24.0s), 5/5 VUs, 94 complete and 0 interrupted iterations
default   [  28% ] 5 VUs  1m24.0s/5m0s

running (1m25.0s), 5/5 VUs, 97 complete and 0 interrupted iterations
default   [  28% ] 5 VUs  1m25.0s/5m0s

running (1m26.0s), 5/5 VUs, 98 complete and 0 interrupted iterations
default   [  29% ] 5 VUs  1m26.0s/5m0s

running (1m27.0s), 5/5 VUs, 98 complete and 0 interrupted iterations
default   [  29% ] 5 VUs  1m27.0s/5m0s

running (1m28.0s), 5/5 VUs, 98 complete and 0 interrupted iterations
default   [  29% ] 5 VUs  1m28.0s/5m0s

running (1m29.0s), 5/5 VUs, 99 complete and 0 interrupted iterations
default   [  30% ] 5 VUs  1m29.0s/5m0s

running (1m30.0s), 5/5 VUs, 101 complete and 0 interrupted iterations
default   [  30% ] 5 VUs  1m30.0s/5m0s

running (1m31.0s), 5/5 VUs, 103 complete and 0 interrupted iterations
default   [  30% ] 5 VUs  1m31.0s/5m0s

running (1m32.0s), 5/5 VUs, 104 complete and 0 interrupted iterations
default   [  31% ] 5 VUs  1m32.0s/5m0s

running (1m33.0s), 5/5 VUs, 106 complete and 0 interrupted iterations
default   [  31% ] 5 VUs  1m33.0s/5m0s

running (1m34.0s), 5/5 VUs, 107 complete and 0 interrupted iterations
default   [  31% ] 5 VUs  1m34.0s/5m0s

running (1m35.0s), 5/5 VUs, 109 complete and 0 interrupted iterations
default   [  32% ] 5 VUs  1m35.0s/5m0s

running (1m36.0s), 5/5 VUs, 109 complete and 0 interrupted iterations
default   [  32% ] 5 VUs  1m36.0s/5m0s

running (1m37.0s), 5/5 VUs, 110 complete and 0 interrupted iterations
default   [  32% ] 5 VUs  1m37.0s/5m0s

running (1m38.0s), 5/5 VUs, 110 complete and 0 interrupted iterations
default   [  33% ] 5 VUs  1m38.0s/5m0s

running (1m39.0s), 5/5 VUs, 114 complete and 0 interrupted iterations
default   [  33% ] 5 VUs  1m39.0s/5m0s

running (1m40.0s), 5/5 VUs, 114 complete and 0 interrupted iterations
default   [  33% ] 5 VUs  1m40.0s/5m0s

running (1m41.0s), 5/5 VUs, 115 complete and 0 interrupted iterations
default   [  34% ] 5 VUs  1m41.0s/5m0s

running (1m42.0s), 5/5 VUs, 116 complete and 0 interrupted iterations
default   [  34% ] 5 VUs  1m42.0s/5m0s

running (1m43.0s), 5/5 VUs, 116 complete and 0 interrupted iterations
default   [  34% ] 5 VUs  1m43.0s/5m0s

running (1m44.0s), 5/5 VUs, 117 complete and 0 interrupted iterations
default   [  35% ] 5 VUs  1m44.0s/5m0s

running (1m45.0s), 5/5 VUs, 119 complete and 0 interrupted iterations
default   [  35% ] 5 VUs  1m45.0s/5m0s

running (1m46.0s), 5/5 VUs, 121 complete and 0 interrupted iterations
default   [  35% ] 5 VUs  1m46.0s/5m0s

running (1m47.0s), 5/5 VUs, 121 complete and 0 interrupted iterations
default   [  36% ] 5 VUs  1m47.0s/5m0s

running (1m48.0s), 5/5 VUs, 121 complete and 0 interrupted iterations
default   [  36% ] 5 VUs  1m48.0s/5m0s

running (1m49.0s), 5/5 VUs, 121 complete and 0 interrupted iterations
default   [  36% ] 5 VUs  1m49.0s/5m0s

running (1m50.0s), 5/5 VUs, 125 complete and 0 interrupted iterations
default   [  37% ] 5 VUs  1m50.0s/5m0s

running (1m51.0s), 5/5 VUs, 126 complete and 0 interrupted iterations
default   [  37% ] 5 VUs  1m51.0s/5m0s

running (1m52.0s), 5/5 VUs, 126 complete and 0 interrupted iterations
default   [  37% ] 5 VUs  1m52.0s/5m0s

running (1m53.0s), 5/5 VUs, 130 complete and 0 interrupted iterations
default   [  38% ] 5 VUs  1m53.0s/5m0s

running (1m54.0s), 5/5 VUs, 131 complete and 0 interrupted iterations
default   [  38% ] 5 VUs  1m54.0s/5m0s

running (1m55.0s), 5/5 VUs, 131 complete and 0 interrupted iterations
default   [  38% ] 5 VUs  1m55.0s/5m0s

running (1m56.0s), 5/5 VUs, 132 complete and 0 interrupted iterations
default   [  39% ] 5 VUs  1m56.0s/5m0s

running (1m57.0s), 5/5 VUs, 134 complete and 0 interrupted iterations
default   [  39% ] 5 VUs  1m57.0s/5m0s

running (1m58.0s), 5/5 VUs, 135 complete and 0 interrupted iterations
default   [  39% ] 5 VUs  1m58.0s/5m0s

running (1m59.0s), 5/5 VUs, 136 complete and 0 interrupted iterations
default   [  40% ] 5 VUs  1m59.0s/5m0s

running (2m00.0s), 5/5 VUs, 137 complete and 0 interrupted iterations
default   [  40% ] 5 VUs  2m00.0s/5m0s

running (2m01.0s), 5/5 VUs, 137 complete and 0 interrupted iterations
default   [  40% ] 5 VUs  2m01.0s/5m0s

running (2m02.0s), 5/5 VUs, 137 complete and 0 interrupted iterations
default   [  41% ] 5 VUs  2m02.0s/5m0s

running (2m03.0s), 5/5 VUs, 139 complete and 0 interrupted iterations
default   [  41% ] 5 VUs  2m03.0s/5m0s

running (2m04.0s), 5/5 VUs, 140 complete and 0 interrupted iterations
default   [  41% ] 5 VUs  2m04.0s/5m0s

running (2m05.0s), 5/5 VUs, 141 complete and 0 interrupted iterations
default   [  42% ] 5 VUs  2m05.0s/5m0s

running (2m06.0s), 5/5 VUs, 143 complete and 0 interrupted iterations
default   [  42% ] 5 VUs  2m06.0s/5m0s

running (2m07.0s), 5/5 VUs, 144 complete and 0 interrupted iterations
default   [  42% ] 5 VUs  2m07.0s/5m0s

running (2m08.0s), 5/5 VUs, 147 complete and 0 interrupted iterations
default   [  43% ] 5 VUs  2m08.0s/5m0s

running (2m09.0s), 5/5 VUs, 148 complete and 0 interrupted iterations
default   [  43% ] 5 VUs  2m09.0s/5m0s

running (2m10.0s), 5/5 VUs, 148 complete and 0 interrupted iterations
default   [  43% ] 5 VUs  2m10.0s/5m0s

running (2m11.0s), 5/5 VUs, 150 complete and 0 interrupted iterations
default   [  44% ] 5 VUs  2m11.0s/5m0s

running (2m12.0s), 5/5 VUs, 151 complete and 0 interrupted iterations
default   [  44% ] 5 VUs  2m12.0s/5m0s

running (2m13.0s), 5/5 VUs, 151 complete and 0 interrupted iterations
default   [  44% ] 5 VUs  2m13.0s/5m0s

running (2m14.0s), 5/5 VUs, 154 complete and 0 interrupted iterations
default   [  45% ] 5 VUs  2m14.0s/5m0s

running (2m15.0s), 5/5 VUs, 156 complete and 0 interrupted iterations
default   [  45% ] 5 VUs  2m15.0s/5m0s

running (2m16.0s), 5/5 VUs, 156 complete and 0 interrupted iterations
default   [  45% ] 5 VUs  2m16.0s/5m0s

running (2m17.0s), 5/5 VUs, 158 complete and 0 interrupted iterations
default   [  46% ] 5 VUs  2m17.0s/5m0s

running (2m18.0s), 5/5 VUs, 158 complete and 0 interrupted iterations
default   [  46% ] 5 VUs  2m18.0s/5m0s

running (2m19.0s), 5/5 VUs, 161 complete and 0 interrupted iterations
default   [  46% ] 5 VUs  2m19.0s/5m0s

running (2m20.0s), 5/5 VUs, 161 complete and 0 interrupted iterations
default   [  47% ] 5 VUs  2m20.0s/5m0s

running (2m21.0s), 5/5 VUs, 161 complete and 0 interrupted iterations
default   [  47% ] 5 VUs  2m21.0s/5m0s

running (2m22.0s), 5/5 VUs, 164 complete and 0 interrupted iterations
default   [  47% ] 5 VUs  2m22.0s/5m0s

running (2m23.0s), 5/5 VUs, 165 complete and 0 interrupted iterations
default   [  48% ] 5 VUs  2m23.0s/5m0s

running (2m24.0s), 5/5 VUs, 166 complete and 0 interrupted iterations
default   [  48% ] 5 VUs  2m24.0s/5m0s

running (2m25.0s), 5/5 VUs, 166 complete and 0 interrupted iterations
default   [  48% ] 5 VUs  2m25.0s/5m0s

running (2m26.0s), 5/5 VUs, 167 complete and 0 interrupted iterations
default   [  49% ] 5 VUs  2m26.0s/5m0s

running (2m27.0s), 5/5 VUs, 169 complete and 0 interrupted iterations
default   [  49% ] 5 VUs  2m27.0s/5m0s

running (2m28.0s), 5/5 VUs, 170 complete and 0 interrupted iterations
default   [  49% ] 5 VUs  2m28.0s/5m0s

running (2m29.0s), 5/5 VUs, 171 complete and 0 interrupted iterations
default   [  50% ] 5 VUs  2m29.0s/5m0s

running (2m30.0s), 5/5 VUs, 172 complete and 0 interrupted iterations
default   [  50% ] 5 VUs  2m30.0s/5m0s

running (2m31.0s), 5/5 VUs, 172 complete and 0 interrupted iterations
default   [  50% ] 5 VUs  2m31.0s/5m0s

running (2m32.0s), 5/5 VUs, 175 complete and 0 interrupted iterations
default   [  51% ] 5 VUs  2m32.0s/5m0s

running (2m33.0s), 5/5 VUs, 176 complete and 0 interrupted iterations
default   [  51% ] 5 VUs  2m33.0s/5m0s

running (2m34.0s), 5/5 VUs, 176 complete and 0 interrupted iterations
default   [  51% ] 5 VUs  2m34.0s/5m0s

running (2m35.0s), 5/5 VUs, 177 complete and 0 interrupted iterations
default   [  52% ] 5 VUs  2m35.0s/5m0s

running (2m36.0s), 5/5 VUs, 178 complete and 0 interrupted iterations
default   [  52% ] 5 VUs  2m36.0s/5m0s

running (2m37.0s), 5/5 VUs, 179 complete and 0 interrupted iterations
default   [  52% ] 5 VUs  2m37.0s/5m0s

running (2m38.0s), 5/5 VUs, 180 complete and 0 interrupted iterations
default   [  53% ] 5 VUs  2m38.0s/5m0s

running (2m39.0s), 5/5 VUs, 181 complete and 0 interrupted iterations
default   [  53% ] 5 VUs  2m39.0s/5m0s

running (2m40.0s), 5/5 VUs, 182 complete and 0 interrupted iterations
default   [  53% ] 5 VUs  2m40.0s/5m0s

running (2m41.0s), 5/5 VUs, 185 complete and 0 interrupted iterations
default   [  54% ] 5 VUs  2m41.0s/5m0s

running (2m42.0s), 5/5 VUs, 185 complete and 0 interrupted iterations
default   [  54% ] 5 VUs  2m42.0s/5m0s

running (2m43.0s), 5/5 VUs, 185 complete and 0 interrupted iterations
default   [  54% ] 5 VUs  2m43.0s/5m0s

running (2m44.0s), 5/5 VUs, 186 complete and 0 interrupted iterations
default   [  55% ] 5 VUs  2m44.0s/5m0s

running (2m45.0s), 5/5 VUs, 188 complete and 0 interrupted iterations
default   [  55% ] 5 VUs  2m45.0s/5m0s

running (2m46.0s), 5/5 VUs, 188 complete and 0 interrupted iterations
default   [  55% ] 5 VUs  2m46.0s/5m0s

running (2m47.0s), 5/5 VUs, 190 complete and 0 interrupted iterations
default   [  56% ] 5 VUs  2m47.0s/5m0s

running (2m48.0s), 5/5 VUs, 191 complete and 0 interrupted iterations
default   [  56% ] 5 VUs  2m48.0s/5m0s

running (2m49.0s), 5/5 VUs, 192 complete and 0 interrupted iterations
default   [  56% ] 5 VUs  2m49.0s/5m0s

running (2m50.0s), 5/5 VUs, 193 complete and 0 interrupted iterations
default   [  57% ] 5 VUs  2m50.0s/5m0s

running (2m51.0s), 5/5 VUs, 194 complete and 0 interrupted iterations
default   [  57% ] 5 VUs  2m51.0s/5m0s

running (2m52.0s), 5/5 VUs, 195 complete and 0 interrupted iterations
default   [  57% ] 5 VUs  2m52.0s/5m0s

running (2m53.0s), 5/5 VUs, 196 complete and 0 interrupted iterations
default   [  58% ] 5 VUs  2m53.0s/5m0s

running (2m54.0s), 5/5 VUs, 197 complete and 0 interrupted iterations
default   [  58% ] 5 VUs  2m54.0s/5m0s

running (2m55.0s), 5/5 VUs, 198 complete and 0 interrupted iterations
default   [  58% ] 5 VUs  2m55.0s/5m0s

running (2m56.0s), 5/5 VUs, 200 complete and 0 interrupted iterations
default   [  59% ] 5 VUs  2m56.0s/5m0s

running (2m57.0s), 5/5 VUs, 201 complete and 0 interrupted iterations
default   [  59% ] 5 VUs  2m57.0s/5m0s

running (2m58.0s), 5/5 VUs, 202 complete and 0 interrupted iterations
default   [  59% ] 5 VUs  2m58.0s/5m0s

running (2m59.0s), 5/5 VUs, 203 complete and 0 interrupted iterations
default   [  60% ] 5 VUs  2m59.0s/5m0s

running (3m00.0s), 5/5 VUs, 204 complete and 0 interrupted iterations
default   [  60% ] 5 VUs  3m00.0s/5m0s

running (3m01.0s), 5/5 VUs, 205 complete and 0 interrupted iterations
default   [  60% ] 5 VUs  3m01.0s/5m0s

running (3m02.0s), 5/5 VUs, 207 complete and 0 interrupted iterations
default   [  61% ] 5 VUs  3m02.0s/5m0s

running (3m03.0s), 5/5 VUs, 207 complete and 0 interrupted iterations
default   [  61% ] 5 VUs  3m03.0s/5m0s

running (3m04.0s), 5/5 VUs, 209 complete and 0 interrupted iterations
default   [  61% ] 5 VUs  3m04.0s/5m0s

running (3m05.0s), 5/5 VUs, 210 complete and 0 interrupted iterations
default   [  62% ] 5 VUs  3m05.0s/5m0s

running (3m06.0s), 5/5 VUs, 211 complete and 0 interrupted iterations
default   [  62% ] 5 VUs  3m06.0s/5m0s

running (3m07.0s), 5/5 VUs, 212 complete and 0 interrupted iterations
default   [  62% ] 5 VUs  3m07.0s/5m0s

running (3m08.0s), 5/5 VUs, 214 complete and 0 interrupted iterations
default   [  63% ] 5 VUs  3m08.0s/5m0s

running (3m09.0s), 5/5 VUs, 214 complete and 0 interrupted iterations
default   [  63% ] 5 VUs  3m09.0s/5m0s

running (3m10.0s), 5/5 VUs, 216 complete and 0 interrupted iterations
default   [  63% ] 5 VUs  3m10.0s/5m0s

running (3m11.0s), 5/5 VUs, 216 complete and 0 interrupted iterations
default   [  64% ] 5 VUs  3m11.0s/5m0s

running (3m12.0s), 5/5 VUs, 218 complete and 0 interrupted iterations
default   [  64% ] 5 VUs  3m12.0s/5m0s

running (3m13.0s), 5/5 VUs, 219 complete and 0 interrupted iterations
default   [  64% ] 5 VUs  3m13.0s/5m0s

running (3m14.0s), 5/5 VUs, 220 complete and 0 interrupted iterations
default   [  65% ] 5 VUs  3m14.0s/5m0s

running (3m15.0s), 5/5 VUs, 222 complete and 0 interrupted iterations
default   [  65% ] 5 VUs  3m15.0s/5m0s

running (3m16.0s), 5/5 VUs, 222 complete and 0 interrupted iterations
default   [  65% ] 5 VUs  3m16.0s/5m0s

running (3m17.0s), 5/5 VUs, 223 complete and 0 interrupted iterations
default   [  66% ] 5 VUs  3m17.0s/5m0s

running (3m18.0s), 5/5 VUs, 224 complete and 0 interrupted iterations
default   [  66% ] 5 VUs  3m18.0s/5m0s

running (3m19.0s), 5/5 VUs, 225 complete and 0 interrupted iterations
default   [  66% ] 5 VUs  3m19.0s/5m0s

running (3m20.0s), 5/5 VUs, 227 complete and 0 interrupted iterations
default   [  67% ] 5 VUs  3m20.0s/5m0s

running (3m21.0s), 5/5 VUs, 227 complete and 0 interrupted iterations
default   [  67% ] 5 VUs  3m21.0s/5m0s

running (3m22.0s), 5/5 VUs, 228 complete and 0 interrupted iterations
default   [  67% ] 5 VUs  3m22.0s/5m0s

running (3m23.0s), 5/5 VUs, 230 complete and 0 interrupted iterations
default   [  68% ] 5 VUs  3m23.0s/5m0s

running (3m24.0s), 5/5 VUs, 231 complete and 0 interrupted iterations
default   [  68% ] 5 VUs  3m24.0s/5m0s

running (3m25.0s), 5/5 VUs, 233 complete and 0 interrupted iterations
default   [  68% ] 5 VUs  3m25.0s/5m0s

running (3m26.0s), 5/5 VUs, 235 complete and 0 interrupted iterations
default   [  69% ] 5 VUs  3m26.0s/5m0s

running (3m27.0s), 5/5 VUs, 235 complete and 0 interrupted iterations
default   [  69% ] 5 VUs  3m27.0s/5m0s

running (3m28.0s), 5/5 VUs, 235 complete and 0 interrupted iterations
default   [  69% ] 5 VUs  3m28.0s/5m0s

running (3m29.0s), 5/5 VUs, 236 complete and 0 interrupted iterations
default   [  70% ] 5 VUs  3m29.0s/5m0s

running (3m30.0s), 5/5 VUs, 238 complete and 0 interrupted iterations
default   [  70% ] 5 VUs  3m30.0s/5m0s

running (3m31.0s), 5/5 VUs, 240 complete and 0 interrupted iterations
default   [  70% ] 5 VUs  3m31.0s/5m0s

running (3m32.0s), 5/5 VUs, 241 complete and 0 interrupted iterations
default   [  71% ] 5 VUs  3m32.0s/5m0s

running (3m33.0s), 5/5 VUs, 242 complete and 0 interrupted iterations
default   [  71% ] 5 VUs  3m33.0s/5m0s

running (3m34.0s), 5/5 VUs, 242 complete and 0 interrupted iterations
default   [  71% ] 5 VUs  3m34.0s/5m0s

running (3m35.0s), 5/5 VUs, 244 complete and 0 interrupted iterations
default   [  72% ] 5 VUs  3m35.0s/5m0s

running (3m36.0s), 5/5 VUs, 247 complete and 0 interrupted iterations
default   [  72% ] 5 VUs  3m36.0s/5m0s

running (3m37.0s), 5/5 VUs, 247 complete and 0 interrupted iterations
default   [  72% ] 5 VUs  3m37.0s/5m0s

running (3m38.0s), 5/5 VUs, 248 complete and 0 interrupted iterations
default   [  73% ] 5 VUs  3m38.0s/5m0s

running (3m39.0s), 5/5 VUs, 251 complete and 0 interrupted iterations
default   [  73% ] 5 VUs  3m39.0s/5m0s

running (3m40.0s), 5/5 VUs, 251 complete and 0 interrupted iterations
default   [  73% ] 5 VUs  3m40.0s/5m0s

running (3m41.0s), 5/5 VUs, 251 complete and 0 interrupted iterations
default   [  74% ] 5 VUs  3m41.0s/5m0s

running (3m42.0s), 5/5 VUs, 256 complete and 0 interrupted iterations
default   [  74% ] 5 VUs  3m42.0s/5m0s

running (3m43.0s), 5/5 VUs, 256 complete and 0 interrupted iterations
default   [  74% ] 5 VUs  3m43.0s/5m0s

running (3m44.0s), 5/5 VUs, 256 complete and 0 interrupted iterations
default   [  75% ] 5 VUs  3m44.0s/5m0s

running (3m45.0s), 5/5 VUs, 257 complete and 0 interrupted iterations
default   [  75% ] 5 VUs  3m45.0s/5m0s

running (3m46.0s), 5/5 VUs, 257 complete and 0 interrupted iterations
default   [  75% ] 5 VUs  3m46.0s/5m0s

running (3m47.0s), 5/5 VUs, 258 complete and 0 interrupted iterations
default   [  76% ] 5 VUs  3m47.0s/5m0s

running (3m48.0s), 5/5 VUs, 262 complete and 0 interrupted iterations
default   [  76% ] 5 VUs  3m48.0s/5m0s

running (3m49.0s), 5/5 VUs, 263 complete and 0 interrupted iterations
default   [  76% ] 5 VUs  3m49.0s/5m0s

running (3m50.0s), 5/5 VUs, 264 complete and 0 interrupted iterations
default   [  77% ] 5 VUs  3m50.0s/5m0s

running (3m51.0s), 5/5 VUs, 264 complete and 0 interrupted iterations
default   [  77% ] 5 VUs  3m51.0s/5m0s

running (3m52.0s), 5/5 VUs, 264 complete and 0 interrupted iterations
default   [  77% ] 5 VUs  3m52.0s/5m0s

running (3m53.0s), 5/5 VUs, 266 complete and 0 interrupted iterations
default   [  78% ] 5 VUs  3m53.0s/5m0s

running (3m54.0s), 5/5 VUs, 268 complete and 0 interrupted iterations
default   [  78% ] 5 VUs  3m54.0s/5m0s

running (3m55.0s), 5/5 VUs, 268 complete and 0 interrupted iterations
default   [  78% ] 5 VUs  3m55.0s/5m0s

running (3m56.0s), 5/5 VUs, 270 complete and 0 interrupted iterations
default   [  79% ] 5 VUs  3m56.0s/5m0s

running (3m57.0s), 5/5 VUs, 272 complete and 0 interrupted iterations
default   [  79% ] 5 VUs  3m57.0s/5m0s

running (3m58.0s), 5/5 VUs, 273 complete and 0 interrupted iterations
default   [  79% ] 5 VUs  3m58.0s/5m0s

running (3m59.0s), 5/5 VUs, 273 complete and 0 interrupted iterations
default   [  80% ] 5 VUs  3m59.0s/5m0s

running (4m00.0s), 5/5 VUs, 275 complete and 0 interrupted iterations
default   [  80% ] 5 VUs  4m00.0s/5m0s

running (4m01.0s), 5/5 VUs, 276 complete and 0 interrupted iterations
default   [  80% ] 5 VUs  4m01.0s/5m0s

running (4m02.0s), 5/5 VUs, 278 complete and 0 interrupted iterations
default   [  81% ] 5 VUs  4m02.0s/5m0s

running (4m03.0s), 5/5 VUs, 279 complete and 0 interrupted iterations
default   [  81% ] 5 VUs  4m03.0s/5m0s

running (4m04.0s), 5/5 VUs, 281 complete and 0 interrupted iterations
default   [  81% ] 5 VUs  4m04.0s/5m0s

running (4m05.0s), 5/5 VUs, 281 complete and 0 interrupted iterations
default   [  82% ] 5 VUs  4m05.0s/5m0s

running (4m06.0s), 5/5 VUs, 283 complete and 0 interrupted iterations
default   [  82% ] 5 VUs  4m06.0s/5m0s

running (4m07.0s), 5/5 VUs, 284 complete and 0 interrupted iterations
default   [  82% ] 5 VUs  4m07.0s/5m0s

running (4m08.0s), 5/5 VUs, 285 complete and 0 interrupted iterations
default   [  83% ] 5 VUs  4m08.0s/5m0s

running (4m09.0s), 5/5 VUs, 287 complete and 0 interrupted iterations
default   [  83% ] 5 VUs  4m09.0s/5m0s

running (4m10.0s), 5/5 VUs, 288 complete and 0 interrupted iterations
default   [  83% ] 5 VUs  4m10.0s/5m0s

running (4m11.0s), 5/5 VUs, 289 complete and 0 interrupted iterations
default   [  84% ] 5 VUs  4m11.0s/5m0s

running (4m12.0s), 5/5 VUs, 292 complete and 0 interrupted iterations
default   [  84% ] 5 VUs  4m12.0s/5m0s

running (4m13.0s), 5/5 VUs, 292 complete and 0 interrupted iterations
default   [  84% ] 5 VUs  4m13.0s/5m0s

running (4m14.0s), 5/5 VUs, 293 complete and 0 interrupted iterations
default   [  85% ] 5 VUs  4m14.0s/5m0s

running (4m15.0s), 5/5 VUs, 294 complete and 0 interrupted iterations
default   [  85% ] 5 VUs  4m15.0s/5m0s

running (4m16.0s), 5/5 VUs, 295 complete and 0 interrupted iterations
default   [  85% ] 5 VUs  4m16.0s/5m0s

running (4m17.0s), 5/5 VUs, 297 complete and 0 interrupted iterations
default   [  86% ] 5 VUs  4m17.0s/5m0s

running (4m18.0s), 5/5 VUs, 298 complete and 0 interrupted iterations
default   [  86% ] 5 VUs  4m18.0s/5m0s

running (4m19.0s), 5/5 VUs, 298 complete and 0 interrupted iterations
default   [  86% ] 5 VUs  4m19.0s/5m0s

running (4m20.0s), 5/5 VUs, 300 complete and 0 interrupted iterations
default   [  87% ] 5 VUs  4m20.0s/5m0s

running (4m21.0s), 5/5 VUs, 301 complete and 0 interrupted iterations
default   [  87% ] 5 VUs  4m21.0s/5m0s

running (4m22.0s), 5/5 VUs, 302 complete and 0 interrupted iterations
default   [  87% ] 5 VUs  4m22.0s/5m0s

running (4m23.0s), 5/5 VUs, 304 complete and 0 interrupted iterations
default   [  88% ] 5 VUs  4m23.0s/5m0s

running (4m24.0s), 5/5 VUs, 305 complete and 0 interrupted iterations
default   [  88% ] 5 VUs  4m24.0s/5m0s

running (4m25.0s), 5/5 VUs, 306 complete and 0 interrupted iterations
default   [  88% ] 5 VUs  4m25.0s/5m0s

running (4m26.0s), 5/5 VUs, 306 complete and 0 interrupted iterations
default   [  89% ] 5 VUs  4m26.0s/5m0s

running (4m27.0s), 5/5 VUs, 307 complete and 0 interrupted iterations
default   [  89% ] 5 VUs  4m27.0s/5m0s

running (4m28.0s), 5/5 VUs, 308 complete and 0 interrupted iterations
default   [  89% ] 5 VUs  4m28.0s/5m0s

running (4m29.0s), 5/5 VUs, 309 complete and 0 interrupted iterations
default   [  90% ] 5 VUs  4m29.0s/5m0s

running (4m30.0s), 5/5 VUs, 311 complete and 0 interrupted iterations
default   [  90% ] 5 VUs  4m30.0s/5m0s

running (4m31.0s), 5/5 VUs, 312 complete and 0 interrupted iterations
default   [  90% ] 5 VUs  4m31.0s/5m0s

running (4m32.0s), 5/5 VUs, 312 complete and 0 interrupted iterations
default   [  91% ] 5 VUs  4m32.0s/5m0s

running (4m33.0s), 5/5 VUs, 313 complete and 0 interrupted iterations
default   [  91% ] 5 VUs  4m33.0s/5m0s

running (4m34.0s), 5/5 VUs, 315 complete and 0 interrupted iterations
default   [  91% ] 5 VUs  4m34.0s/5m0s

running (4m35.0s), 5/5 VUs, 315 complete and 0 interrupted iterations
default   [  92% ] 5 VUs  4m35.0s/5m0s

running (4m36.0s), 5/5 VUs, 317 complete and 0 interrupted iterations
default   [  92% ] 5 VUs  4m36.0s/5m0s

running (4m37.0s), 5/5 VUs, 317 complete and 0 interrupted iterations
default   [  92% ] 5 VUs  4m37.0s/5m0s

running (4m38.0s), 5/5 VUs, 318 complete and 0 interrupted iterations
default   [  93% ] 5 VUs  4m38.0s/5m0s

running (4m39.0s), 5/5 VUs, 320 complete and 0 interrupted iterations
default   [  93% ] 5 VUs  4m39.0s/5m0s

running (4m40.0s), 5/5 VUs, 322 complete and 0 interrupted iterations
default   [  93% ] 5 VUs  4m40.0s/5m0s

running (4m41.0s), 5/5 VUs, 322 complete and 0 interrupted iterations
default   [  94% ] 5 VUs  4m41.0s/5m0s

running (4m42.0s), 5/5 VUs, 324 complete and 0 interrupted iterations
default   [  94% ] 5 VUs  4m42.0s/5m0s

running (4m43.0s), 5/5 VUs, 324 complete and 0 interrupted iterations
default   [  94% ] 5 VUs  4m43.0s/5m0s

running (4m44.0s), 5/5 VUs, 325 complete and 0 interrupted iterations
default   [  95% ] 5 VUs  4m44.0s/5m0s

running (4m45.0s), 5/5 VUs, 326 complete and 0 interrupted iterations
default   [  95% ] 5 VUs  4m45.0s/5m0s

running (4m46.0s), 5/5 VUs, 327 complete and 0 interrupted iterations
default   [  95% ] 5 VUs  4m46.0s/5m0s

running (4m47.0s), 5/5 VUs, 330 complete and 0 interrupted iterations
default   [  96% ] 5 VUs  4m47.0s/5m0s

running (4m48.0s), 5/5 VUs, 330 complete and 0 interrupted iterations
default   [  96% ] 5 VUs  4m48.0s/5m0s

running (4m49.0s), 5/5 VUs, 333 complete and 0 interrupted iterations
default   [  96% ] 5 VUs  4m49.0s/5m0s

running (4m50.0s), 5/5 VUs, 335 complete and 0 interrupted iterations
default   [  97% ] 5 VUs  4m50.0s/5m0s

running (4m51.0s), 5/5 VUs, 335 complete and 0 interrupted iterations
default   [  97% ] 5 VUs  4m51.0s/5m0s

running (4m52.0s), 5/5 VUs, 337 complete and 0 interrupted iterations
default   [  97% ] 5 VUs  4m52.0s/5m0s

running (4m53.0s), 5/5 VUs, 339 complete and 0 interrupted iterations
default   [  98% ] 5 VUs  4m53.0s/5m0s

running (4m54.0s), 5/5 VUs, 339 complete and 0 interrupted iterations
default   [  98% ] 5 VUs  4m54.0s/5m0s

running (4m55.0s), 5/5 VUs, 341 complete and 0 interrupted iterations
default   [  98% ] 5 VUs  4m55.0s/5m0s

running (4m56.0s), 5/5 VUs, 343 complete and 0 interrupted iterations
default   [  99% ] 5 VUs  4m56.0s/5m0s

running (4m57.0s), 5/5 VUs, 345 complete and 0 interrupted iterations
default   [  99% ] 5 VUs  4m57.0s/5m0s

running (4m58.0s), 5/5 VUs, 345 complete and 0 interrupted iterations
default   [  99% ] 5 VUs  4m58.0s/5m0s

running (4m59.0s), 5/5 VUs, 346 complete and 0 interrupted iterations
default   [ 100% ] 5 VUs  4m59.0s/5m0s

running (5m00.0s), 5/5 VUs, 346 complete and 0 interrupted iterations
default   [ 100% ] 5 VUs  5m00.0s/5m0s

running (5m01.0s), 4/5 VUs, 347 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5m0s

running (5m02.0s), 1/5 VUs, 350 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5m0s

running (5m03.0s), 1/5 VUs, 350 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5m0s

running (5m04.0s), 1/5 VUs, 350 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5m0s

     ✓ login status is 2xx
     ✓ eps tree status is 2xx
     ✓ execution vendors status is 2xx
     ✓ execution has-micro status is 2xx
     ✗ execution breakdown status is 2xx
      ↳  0% — ✓ 0 / ✗ 351

     checks.........................: 80.00% ✓ 1404     ✗ 351 
     data_received..................: 16 MB  51 kB/s
     data_sent......................: 16 MB  53 kB/s
     http_req_blocked...............: avg=143.05µs min=0s      med=0s      max=32.09ms  p(90)=0s       p(95)=0s      
     http_req_connecting............: avg=137.46µs min=0s      med=0s      max=32.09ms  p(90)=0s       p(95)=0s      
   ✓ http_req_duration..............: avg=58.4ms   min=1.08ms  med=21.72ms max=1.01s    p(90)=160.4ms  p(95)=195.83ms
       { expected_response:true }...: avg=66.33ms  min=1.08ms  med=22.75ms max=1.01s    p(90)=175.49ms p(95)=200.61ms
     http_req_failed................: 20.00% ✓ 351      ✗ 1404
     http_req_receiving.............: avg=5.86ms   min=0s      med=0s      max=350.92ms p(90)=12.48ms  p(95)=15.66ms 
     http_req_sending...............: avg=404.6µs  min=0s      med=299.8µs max=10.31ms  p(90)=650.58µs p(95)=710.12µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=52.14ms  min=529.4µs med=18.28ms max=695.93ms p(90)=148.58ms p(95)=179.9ms 
     http_reqs......................: 1755   5.765455/s
     iteration_duration.............: avg=4.29s    min=2.24s   med=4.38s   max=6.51s    p(90)=5.9s     p(95)=6.08s   
     iterations.....................: 351    1.153091/s
     vus............................: 1      min=1      max=5 
     vus_max........................: 5      min=5      max=5 


running (5m04.4s), 0/5 VUs, 351 complete and 0 interrupted iterations
default ✓ [ 100% ] 5 VUs  5m0s